## Week 14

In [2]:
%load_ext sql

In [3]:
%%sql
sqlite:///courses_data.sqlite

In [4]:
%%sql
SELECT * 
FROM sqlite_master;

 * sqlite:///courses_data.sqlite
Done.

[('table', 'students', 'students', 2, 'CREATE TABLE students (\n\tstudent_id INTEGER, \n\tfirst_name TEXT, \n\tlast_name TEXT, \n\tmajor TEXT\n)'),
 ('table', 'mth141', 'mth141', 3, 'CREATE TABLE mth141 (\n\tstudent_id INTEGER, \n\tgrade TEXT\n)'),
 ('table', 'eng101', 'eng101', 4, 'CREATE TABLE eng101 (\n\tstudent_id INTEGER, \n\tgrade TEXT\n)')]

In [5]:
%%sql
SELECT * 
FROM students
LIMIT 5

 * sqlite:///courses_data.sqlite
Done.

[(196, 'Rosina', 'Hovey', 'biology'),
 (165, 'Stanton', 'Mcgaugh', 'biology'),
 (123, 'Jonnie', 'Hillock', 'mathematics'),
 (136, 'Chu', 'Flax', 'mathematics'),
 (122, 'Rosalinda', 'Trippe', 'biology')]

In [6]:
%%sql 
SELECT * 
FROM mth141

 * sqlite:///courses_data.sqlite
Done.

[(122, 'A'),
 (109, 'C'),
 (127, 'A'),
 (140, 'F'),
 (145, 'C'),
 (157, 'F'),
 (188, 'C')]

In [7]:
%%sql 
SELECT * 
FROM eng101

 * sqlite:///courses_data.sqlite
Done.

[(165, 'F'), (123, 'C'), (122, 'A'), (189, 'A'), (140, 'D'), (188, 'A')]

## INNER JOIN

In [13]:
%%sql
SELECT 
    m.student_id, 
    m.grade AS mth141_grade,
    e.grade AS eng101_grade
FROM mth141 AS m INNER JOIN eng101 AS e
ON m.student_id = e.student_id

 * sqlite:///courses_data.sqlite
Done.

[(122, 'A', 'A'), (140, 'F', 'D'), (188, 'C', 'A')]

## LEFT JOIN

In [14]:
%%sql
SELECT 
    m.student_id, 
    m.grade AS mth141_grade,
    e.grade AS eng101_grade
FROM mth141 AS m LEFT JOIN eng101 AS e
ON m.student_id = e.student_id

 * sqlite:///courses_data.sqlite
Done.

[(122, 'A', 'A'),
 (109, 'C', None),
 (127, 'A', None),
 (140, 'F', 'D'),
 (145, 'C', None),
 (157, 'F', None),
 (188, 'C', 'A')]

## Simulated RIGHT JOIN

In [15]:
%%sql
SELECT 
    e.student_id, 
    m.grade AS mth141_grade,
    e.grade AS eng101_grade
FROM eng101 AS e  LEFT JOIN mth141 AS m
ON m.student_id = e.student_id

 * sqlite:///courses_data.sqlite
Done.

[(165, None, 'F'),
 (123, None, 'C'),
 (122, 'A', 'A'),
 (189, None, 'A'),
 (140, 'F', 'D'),
 (188, 'C', 'A')]

## Simulated FULL OUTER JOIN

In [21]:
%%sql 
SELECT 
    m.student_id, 
    m.grade AS mth141_grade,
    e.grade AS eng101_grade
FROM mth141 AS m LEFT JOIN eng101 AS e
ON m.student_id = e.student_id
UNION 
SELECT 
    e.student_id, 
    m.grade AS mth141_grade,
    e.grade AS eng101_grade
FROM eng101 AS e  LEFT JOIN mth141 AS m
ON m.student_id = e.student_id

 * sqlite:///courses_data.sqlite
Done.

[(109, 'C', None),
 (122, 'A', 'A'),
 (123, None, 'C'),
 (127, 'A', None),
 (140, 'F', 'D'),
 (145, 'C', None),
 (157, 'F', None),
 (165, None, 'F'),
 (188, 'C', 'A'),
 (189, None, 'A')]

## More complex queries

In [24]:
%%sql
SELECT
   students.*,
   c.mth141_grade,
   c.eng101_grade
FROM 
(
    SELECT 
        m.student_id, 
        m.grade AS mth141_grade,
        e.grade AS eng101_grade
    FROM mth141 AS m LEFT JOIN eng101 AS e
    ON m.student_id = e.student_id
    UNION 
    SELECT 
        e.student_id, 
        m.grade AS mth141_grade,
        e.grade AS eng101_grade
    FROM eng101 AS e  LEFT JOIN mth141 AS m
    ON m.student_id = e.student_id
) AS c INNER JOIN students
ON c.student_id = students.student_id

 * sqlite:///courses_data.sqlite
Done.

[(165, 'Stanton', 'Mcgaugh', 'biology', None, 'F'),
 (123, 'Jonnie', 'Hillock', 'mathematics', None, 'C'),
 (122, 'Rosalinda', 'Trippe', 'biology', 'A', 'A'),
 (109, 'Shawnna', 'Coate', 'mathematics', 'C', None),
 (189, 'Marcia', 'Hinkel', 'mathematics', None, 'A'),
 (127, 'Adelina', 'Brummitt', 'biology', 'A', None),
 (140, 'Ludivina', 'Hoskin', 'computer science', 'F', 'D'),
 (145, 'Ilona', 'Rabe', 'computer science', 'C', None),
 (157, 'Wilbert', 'Haskell', 'computer science', 'F', None),
 (188, 'Randall', 'Lindbloom', 'mathematics', 'C', 'A')]

## Views

In [39]:
%%sql
DROP VIEW IF EXISTS combined_grades;
CREATE TEMP VIEW combined_grades
AS 
SELECT 
    m.student_id, 
    m.grade AS mth141_grade,
    e.grade AS eng101_grade
FROM mth141 AS m LEFT JOIN eng101 AS e
ON m.student_id = e.student_id
UNION 
SELECT 
    e.student_id, 
    m.grade AS mth141_grade,
    e.grade AS eng101_grade
FROM eng101 AS e  LEFT JOIN mth141 AS m
ON m.student_id = e.student_id

 * sqlite:///courses_data.sqlite
Done.
Done.

[]

In [26]:
%%sql
SELECT * 
FROM combined_grades

 * sqlite:///courses_data.sqlite
Done.

[(109, 'C', None),
 (122, 'A', 'A'),
 (123, None, 'C'),
 (127, 'A', None),
 (140, 'F', 'D'),
 (145, 'C', None),
 (157, 'F', None),
 (165, None, 'F'),
 (188, 'C', 'A'),
 (189, None, 'A')]

In [27]:
%%sql
SELECT
   students.*,
   c.mth141_grade,
   c.eng101_grade
FROM 
combined_grades AS c INNER JOIN students
ON c.student_id = students.student_id

 * sqlite:///courses_data.sqlite
Done.

[(165, 'Stanton', 'Mcgaugh', 'biology', None, 'F'),
 (123, 'Jonnie', 'Hillock', 'mathematics', None, 'C'),
 (122, 'Rosalinda', 'Trippe', 'biology', 'A', 'A'),
 (109, 'Shawnna', 'Coate', 'mathematics', 'C', None),
 (189, 'Marcia', 'Hinkel', 'mathematics', None, 'A'),
 (127, 'Adelina', 'Brummitt', 'biology', 'A', None),
 (140, 'Ludivina', 'Hoskin', 'computer science', 'F', 'D'),
 (145, 'Ilona', 'Rabe', 'computer science', 'C', None),
 (157, 'Wilbert', 'Haskell', 'computer science', 'F', None),
 (188, 'Randall', 'Lindbloom', 'mathematics', 'C', 'A')]

In [28]:
%%sql 
SELECT * 
FROM sqlite_master;

 * sqlite:///courses_data.sqlite
Done.

[('table', 'students', 'students', 2, 'CREATE TABLE students (\n\tstudent_id INTEGER, \n\tfirst_name TEXT, \n\tlast_name TEXT, \n\tmajor TEXT\n)'),
 ('table', 'mth141', 'mth141', 3, 'CREATE TABLE mth141 (\n\tstudent_id INTEGER, \n\tgrade TEXT\n)'),
 ('table', 'eng101', 'eng101', 4, 'CREATE TABLE eng101 (\n\tstudent_id INTEGER, \n\tgrade TEXT\n)'),
 ('view', 'combined_grades', 'combined_grades', 0, 'CREATE VIEW combined_grades AS \nSELECT \n    m.student_id, \n    m.grade AS mth141_grade,\n    e.grade AS eng101_grade\nFROM mth141 AS m LEFT JOIN e ... (62 characters truncated) ...    e.student_id, \n    m.grade AS mth141_grade,\n    e.grade AS eng101_grade\nFROM eng101 AS e  LEFT JOIN mth141 AS m\nON m.student_id = e.student_id')]

## SQL with Python

In [40]:
import sqlalchemy
engine = sqlalchemy.create_engine("sqlite:///movie_data.sqlite")

In [42]:
import pandas as pd

df = pd.DataFrame({'title': ['Casablanca', 'Forrest Gump', 'Goodfellas',
                              'Chinatown', 'Jaws', 'Wall-E'],
                   'director': ['M. Curtiz', 'R. Zemeckis', 'M. Scorsese',
                                 'R. Polanski', 'S. Spielberg', 'A. Stanton'],
                   'year': [1942, 1994, 1990, 1974, 1975, 2008]})

In [43]:
df

          title      director  year
0    Casablanca     M. Curtiz  1942
1  Forrest Gump   R. Zemeckis  1994
2    Goodfellas   M. Scorsese  1990
3     Chinatown   R. Polanski  1974
4          Jaws  S. Spielberg  1975
5        Wall-E    A. Stanton  2008

In [45]:
df.to_sql("movies",
          con=engine,
          index=False,
          dtype={"title": sqlalchemy.types.TEXT,
                 "director": sqlalchemy.types.TEXT,
                 "year": sqlalchemy.types.INT}
)

In [46]:
%%sql
sqlite:///movie_data.sqlite

In [47]:
%%sql
SELECT * 
FROM movies

   sqlite:///courses_data.sqlite
 * sqlite:///movie_data.sqlite
Done.

[('Casablanca', 'M. Curtiz', 1942),
 ('Forrest Gump', 'R. Zemeckis', 1994),
 ('Goodfellas', 'M. Scorsese', 1990),
 ('Chinatown', 'R. Polanski', 1974),
 ('Jaws', 'S. Spielberg', 1975),
 ('Wall-E', 'A. Stanton', 2008)]

In [48]:
query = """
SELECT * 
FROM movies 
WHERE year > 1980
ORDER BY year DESC
"""

query

'\nSELECT * \nFROM movies \nWHERE year > 1980\nORDER BY year DESC\n'

In [49]:
result = pd.read_sql_query(query, con=engine)
result

          title     director  year
0        Wall-E   A. Stanton  2008
1  Forrest Gump  R. Zemeckis  1994
2    Goodfellas  M. Scorsese  1990

## Extra credit project

In [51]:
%%sql 
sqlite:///music_data.sqlite

In [52]:
%%sql
SELECT * 
FROM sqlite_master

   sqlite:///courses_data.sqlite
   sqlite:///movie_data.sqlite
 * sqlite:///music_data.sqlite
Done.

[('table', 'albums', 'albums', 2, 'CREATE TABLE "albums"\r\n(\r\n    [AlbumId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Title] NVARCHAR(160)  NOT NULL,\r\n    [ArtistId] INTEGER  NOT NULL,\r\n    FOREIGN KEY ([ArtistId]) REFERENCES "artists" ([ArtistId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'artists', 'artists', 4, 'CREATE TABLE "artists"\r\n(\r\n    [ArtistId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'),
 ('table', 'genres', 'genres', 10, 'CREATE TABLE "genres"\r\n(\r\n    [GenreId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'),
 ('table', 'media_types', 'media_types', 15, 'CREATE TABLE "media_types"\r\n(\r\n    [MediaTypeId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'),
 ('table', 'tracks', 'tracks', 20, 'CREATE TABLE "tracks"\r\n(\r\n    [TrackId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(200)  NOT NULL,\r\n    [AlbumId] INTEG ... (415 characters truncated) ... ON UPDATE NO ACTION,\r\n    FOREIGN KEY ([MediaTypeId]) REFERENCES "media_types" ([MediaTypeId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)')]

In [54]:
%%sql
SELECT * 
FROM tracks
LIMIT 5

   sqlite:///courses_data.sqlite
   sqlite:///movie_data.sqlite
 * sqlite:///music_data.sqlite
Done.

[(1, 'For Those About To Rock (We Salute You)', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 343719, 11170334, 0.99),
 (2, 'Balls to the Wall', 2, 2, 1, None, 342562, 5510424, 0.99),
 (3, 'Fast As a Shark', 3, 2, 1, 'F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman', 230619, 3990994, 0.99),
 (4, 'Restless and Wild', 3, 2, 1, 'F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman', 252051, 4331779, 0.99),
 (5, 'Princess of the Dawn', 3, 2, 1, 'Deaffy & R.A. Smith-Diesel', 375418, 6290521, 0.99)]

In [56]:
%%sql 
SELECT * 
FROM media_types
LIMIT 5

   sqlite:///courses_data.sqlite
   sqlite:///movie_data.sqlite
 * sqlite:///music_data.sqlite
Done.

[(1, 'MPEG audio file'),
 (2, 'Protected AAC audio file'),
 (3, 'Protected MPEG-4 video file'),
 (4, 'Purchased AAC audio file'),
 (5, 'AAC audio file')]

In [57]:
%%sql 
SELECT * 
FROM genres

   sqlite:///courses_data.sqlite
   sqlite:///movie_data.sqlite
 * sqlite:///music_data.sqlite
Done.

[(1, 'Rock'),
 (2, 'Jazz'),
 (3, 'Metal'),
 (4, 'Alternative & Punk'),
 (5, 'Rock And Roll'),
 (6, 'Blues'),
 (7, 'Latin'),
 (8, 'Reggae'),
 (9, 'Pop'),
 (10, 'Soundtrack'),
 (11, 'Bossa Nova'),
 (12, 'Easy Listening'),
 (13, 'Heavy Metal'),
 (14, 'R&B/Soul'),
 (15, 'Electronica/Dance'),
 (16, 'World'),
 (17, 'Hip Hop/Rap'),
 (18, 'Science Fiction'),
 (19, 'TV Shows'),
 (20, 'Sci Fi & Fantasy'),
 (21, 'Drama'),
 (22, 'Comedy'),
 (23, 'Alternative'),
 (24, 'Classical'),
 (25, 'Opera')]

In [58]:
%%sql
SELECT * 
FROM artists
LIMIT 5

   sqlite:///courses_data.sqlite
   sqlite:///movie_data.sqlite
 * sqlite:///music_data.sqlite
Done.

[(1, 'AC/DC'),
 (2, 'Accept'),
 (3, 'Aerosmith'),
 (4, 'Alanis Morissette'),
 (5, 'Alice In Chains')]

In [59]:
%%sql 
SELECT * 
FROM albums 
LIMIT 5

   sqlite:///courses_data.sqlite
   sqlite:///movie_data.sqlite
 * sqlite:///music_data.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3)]